public/man/man1/nix3-profile-list.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - nix3-profile-list.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - nix3-profile-list.1</h1>
    
<p><strong>Warning</strong><br>
This program is <strong>experimental</strong> and its interface is subject to change.</p>
<p>#+end_quote</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Name
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p><code class="verbatim">nix profile list</code> - list installed packages</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Synopsis
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><code class="verbatim">nix profile list</code> [/option/…]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Examples
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<ul>
<li>Show what packages are installed in the default profile:</li>
</ul>
<pre class="example">
# nix profile list
Name:               gdb
Flake attribute:    legacyPackages.x86_64-linux.gdb
Original flake URL: flake:nixpkgs
Locked flake URL:   github:NixOS/nixpkgs/7b38b03d76ab71bdc8dc325e3f6338d984cc35ca
Store paths:        /nix/store/indzcw5wvlhx6vwk7k4iq29q15chvr3d-gdb-11.1

Name:               blender-bin
Flake attribute:    packages.x86_64-linux.default
Original flake URL: flake:blender-bin
Locked flake URL:   github:edolstra/nix-warez/91f2ffee657bf834e4475865ae336e2379282d34?dir=blender
Store paths:        /nix/store/i798sxl3j40wpdi1rgf391id1b5klw7g-blender-bin-3.1.2
</pre>
<blockquote>
<p>Note that you can unambiguously rebuild a package from a profile through
its locked flake URL and flake attribute, e.g.</p>
</blockquote>
<pre class="example">
# nix build github:edolstra/nix-warez/91f2ffee657bf834e4475865ae336e2379282d34?dir=blender#packages.x86_64-linux.default
</pre>
<blockquote>
<p>will build the package <code class="verbatim">blender-bin</code> shown above.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Description
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>This command shows what packages are currently installed in a profile.
For each installed package, it shows the following information:</p>
<ul>
<li><code class="verbatim">Name</code>: A unique name used to unambiguously identify the package in
invocations of <code class="verbatim">nix profile remove</code> and <code class="verbatim">nix profile</code> upgrade.</li>
<li><code class="verbatim">Index</code>: An integer that can be used to unambiguously identify the
package in invocations of <code class="verbatim">nix profile remove</code> and
<code class="verbatim">nix profile upgrade</code>. (<em>Deprecated, will be removed in a future
version in favor of <code class="verbatim">Name</code>.</em>)</li>
<li><code class="verbatim">Flake attribute</code>: The flake output attribute path that provides the
package (e.g. <code class="verbatim">packages.x86_64-linux.hello</code>).</li>
<li><code class="verbatim">Original flake URL</code>: The original (“unlocked”) flake reference
specified by the user when the package was first installed via <code class="verbatim">nix</code>
profile install.</li>
<li><code class="verbatim">Locked flake URL</code>: The locked flake reference to which the original
flake reference was resolved.</li>
<li><code class="verbatim">Store paths</code>: The store path(s) of the package.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Options
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<ul>
<li><code class="verbatim">--json</code>

Produce output in JSON format, suitable for consumption by another
program.</li>
<li><code class="verbatim">--profile</code> <em>path</em>

The profile to operate on.</li>
</ul>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Common evaluation options
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<ul>
<li><code class="verbatim">--arg</code> <em>name</em> <em>expr</em>

Pass the value <em>expr</em> as the argument <em>name</em> to Nix functions.</li>
<li><code class="verbatim">--arg-from-file</code> <em>name</em> <em>path</em>

Pass the contents of file <em>path</em> as the argument <em>name</em> to Nix
functions.</li>
<li><code class="verbatim">--arg-from-stdin</code> <em>name</em>

Pass the contents of stdin as the argument <em>name</em> to Nix functions.</li>
<li><code class="verbatim">--argstr</code> <em>name</em> <em>string</em>

Pass the string <em>string</em> as the argument <em>name</em> to Nix functions.</li>
<li><code class="verbatim">--debugger</code>

Start an interactive environment if evaluation fails.</li>
<li><code class="verbatim">--eval-store</code> <em>store-url</em>

The <strong>URL of the Nix store</strong> to use for evaluation, i.e. to store
derivations (<code class="verbatim">.drv</code> files) and inputs referenced by them.</li>
<li><code class="verbatim">--impure</code>

Allow access to mutable paths and repositories.</li>
<li><code class="verbatim">--include</code> / <code class="verbatim">-I</code> <em>path</em>

Add <em>path</em> to search path entries used to resolve <strong>lookup paths</strong>

This option may be given multiple times.

Paths added through <code class="verbatim">-I</code> take precedence over the <code class="verbatim">nix-path</code>
configuration setting and the <code class="verbatim">NIX_PATH</code> environment variable.</li>
<li><code class="verbatim">--override-flake</code> <em>original-ref</em> <em>resolved-ref</em>

Override the flake registries, redirecting <em>original-ref</em> to
<em>resolved-ref</em>.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Logging-related options
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<ul>
<li><code class="verbatim">--debug</code>

Set the logging verbosity level to ‘debug&#39;.</li>
<li><code class="verbatim">--log-format</code> <em>format</em>

Set the format of log output; one of <code class="verbatim">raw</code>, <code class="verbatim">internal-json</code>, <code class="verbatim">bar</code> or
<code class="verbatim">bar-with-logs</code>.</li>
<li><code class="verbatim">--print-build-logs</code> / <code class="verbatim">-L</code>

Print full build logs on standard error.</li>
<li><code class="verbatim">--quiet</code>

Decrease the logging verbosity level.</li>
<li><code class="verbatim">--verbose</code> / <code class="verbatim">-v</code>

Increase the logging verbosity level.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Miscellaneous global options
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<ul>
<li><code class="verbatim">--help</code>

Show usage information.</li>
<li><code class="verbatim">--offline</code>

Disable substituters and consider all previously downloaded files
up-to-date.</li>
<li><code class="verbatim">--option</code> <em>name</em> <em>value</em>

Set the Nix configuration setting <em>name</em> to <em>value</em> (overriding
<code class="verbatim">nix.conf</code>).</li>
<li><code class="verbatim">--refresh</code>

Consider all previously downloaded files out-of-date.</li>
<li><code class="verbatim">--repair</code>

During evaluation, rewrite missing or corrupted files in the Nix
store. During building, rebuild missing or corrupted store paths.</li>
<li><code class="verbatim">--version</code>

Show version information.

<strong>Note</strong>

See <code class="verbatim">man nix.conf</code> for overriding configuration settings with command
line flags.</li>
</ul>
</div>
</div>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
